<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
    
<%@ page isErrorPage="true" %> 
    
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
	<!-- 발생된 exception 객체의 예외 클래스 이름을 출력 -->
	발생한 예외 종류:<%=exception.getClass().getName()%>
	
	<!-- 
		사용 브라우저가 IE일 경우는 에러 페이지가 513바이트 이상 되어야 인식
		사용 브라우저가 IE일 경우는 에러 페이지가 513바이트 이상 되어야 인식
		사용 브라우저가 IE일 경우는 에러 페이지가 513바이트 이상 되어야 인식
		사용 브라우저가 IE일 경우는 에러 페이지가 513바이트 이상 되어야 인식
		사용 브라우저가 IE일 경우는 에러 페이지가 513바이트 이상 되어야 인식
		사용 브라우저가 IE일 경우는 에러 페이지가 513바이트 이상 되어야 인식
		사용 브라우저가 IE일 경우는 에러 페이지가 513바이트 이상 되어야 인식
		사용 브라우저가 IE일 경우는 에러 페이지가 513바이트 이상 되어야 인식
		사용 브라우저가 IE일 경우는 에러 페이지가 513바이트 이상 되어야 인식
		사용 브라우저가 IE일 경우는 에러 페이지가 513바이트 이상 되어야 인식
		사용 브라우저가 IE일 경우는 에러 페이지가 513바이트 이상 되어야 인식
		사용 브라우저가 IE일 경우는 에러 페이지가 513바이트 이상 되어야 인식
		사용 브라우저가 IE일 경우는 에러 페이지가 513바이트 이상 되어야 인식
	
	
	 -->
	
</body>
</html>




